{"scenario": "Scenario: José Martinez, 50 y/o, is experiencing severe back pain after lifting boxes at work. He speaks only Spanish and nods in agreement to everything.", "reference_response":"He must understand the pricing and medical instructions since he nodded his head.", "evaluation": "This response assumes he understands all of the instructions provided, but he has not taken any notes of what you have said. Instead of assuming he understands, ask follow up questions and ask him to repeat information to you. If needed, provide him with written instructions and pricing information. Ensure he has health insurance or another way to pay for medical treatment and understands how to use it. Score: 3/10"}
{"scenario": "Scenario: Wen Li, 48 y/o woman, comes with a friend who translates loosely. She has shortness of breath, swelling in her legs, and difficulty lying flat. The friend says, 'She tired a lot.", "reference_response":"After checking her chart, you find that she has come in for this issue before. Ask the translator if Ms.Lee understands she needs to take the water pills every day and cut salt.", "evaluation": "It is good to check for understanding, however this user assumes understanding based on a third-party translation without confirming comprehension. Important medication instructions must be clarified directly, ideally using a certified interpreter or teach-back method. Score: 4/10"}
{"scenario": "Scenario: Musa Kamara, 45 y/o refugee, reports joint pain and morning stiffness. He describes it as 'cold in bones' and nods at each question. He avoids eye contact.", "reference_response":"He seems fine with the treatment plan. No need to explain further. His nodding confirms that he understands my instructions.", "evaluation": "The user assumes agreement equals understanding. Nodding can be a cultural signal of politeness, not comprehension. Further questioning and use of visuals or translated materials is advised. Score: 1/10"}
{"scenario": "Scenario: Fatima Bakar, 38 y/o Somali woman, arrives with her teenage daughter translating. She has abdominal pain and irregular bleeding but is quiet and withdrawn.", "reference_response":"As long as the daughter translates, we’re covered legally and ethically.", "evaluation": "Using a minor family member as a translator is inappropriate, especially for sensitive issues. This introduces bias, embarrassment, and potential miscommunication. A professional interpreter should be used and comprehension should be checked with the patient. Score: 3/10"}
{"scenario": "Scenario: Roberto Silva, 55 y/o male with diabetes, shows a worsening foot ulcer. He speaks only Spanish and nods when asked if he knows how to care for the wound.", "reference_response":"He nodded, so he understands how to apply the dressing and when to return.", "evaluation": "The nod does not confirm understanding of wound care. Patients with LEP require confirmation through demonstration or verbal repetition. Miscommunication can lead to serious complications. Score: 3/10"}
{"scenario": "Scenario: Ayaka Tanaka, 26 y/o female, presents with a sore throat, difficulty swallowing, and swollen glands. She doesn’t speak much English and keeps repeating 'ok' to questions.", "reference_response":"Even though she said 'ok' I need to confirm she understands the instructions, take the time to sketch out care instructions and write time stamps underneath so she knows when to perform care", "evaluation": "You are right, relying on 'ok' without verifying comprehension is unsafe. Score: 8/10"}
{"scenario": "Scenario: Huan Zhang, 61 y/o male, reports fatigue and yellowing of the eyes. He appears confused by medical terms. The provider gives instructions in English only.", "reference_response":"He didn’t ask any questions, so I think he understands everything.", "evaluation": "Silence or lack of questions should not be interpreted as comprehension. When a patient has limited English proficiency, actively confirm understanding through teach-back or interpreter services. Score: 2/10"}
{"scenario": "Scenario: Zahra Bashir, 19 y/o Somali student, is visibly distressed but says little. She speaks very basic English and avoids conversation. No interpreter is available.", "reference_response":"She said she’s fine. I’ll just write 'no concerns' in the chart.", "evaluation": "This dismisses nonverbal signs of distress. A lack of verbal complaint does not equal no problem. Communication must be supported with a translator, and observation of affect and body language should prompt further inquiry. Score: 2/10"}
{"scenario": "Scenario: Rashid Al-Mansour, 33 y/o male, speaks Arabic only. He presents with cough and bloody mucus. The clinician uses Google Translate to give discharge instructions.", "reference_response":"I used Google Translate so he should be good to go", "evaluation": "While Google Translate may help in a pinch, it is unreliable for medical instructions. For discharge directions especially, use of a certified interpreter and confirmation of understanding are critical. Score: 4/10"}
{"scenario": "Scenario: Ludmila Petrova, 77 y/o Russian woman, is confused and accompanied by a neighbor who says she 'sometimes forgets things.' No formal history is taken.", "reference_response":" The neighbor explained everything. I think that’s enough to proceed", "evaluation": "Third-party explanations cannot replace direct communication with the patient, especially when confusion is present. This case calls for a certified interpreter and possible cognitive screening. Score: 3/10"}
{"scenario": "Scenario: Ahmad Rahman, 28 y/o male, has a swollen, red, painful leg. He struggles with English. The clinician gives a brief summary and hands him paperwork in English only.", "reference_response":"He can just read the instructions later.", "evaluation": "Providing English-only materials to a patient with limited English proficiency is not effective. Use translated documents, interpreter support, or visual instructions with follow-up confirmation. Score: 3/10"}
{"scenario": "Scenario: Amira Nassar, 44 y/o Egyptian woman, comes in with fatigue and dizziness. She speaks limited English and is accompanied by her adult son.", "reference_response":" I asked the son to step out and used a certified interpreter. I confirmed her understanding with teach-back. I also explained care instructions to the son while keeping medical details private so she could ask him for help incase she forgets.", "evaluation": "Excellent communication strategy. Using a certified interpreter while ensuring privacy and confirming understanding through teach-back ensures safe and ethical care. Score: 10/10"}
{"scenario": "Scenario: Dae-Hyun Park, 66 y/o Korean man, presents with abdominal pain and constipation. He speaks little English. Provider uses simplified English and gestures, then has him explain the plan back in his own words.", "reference_response":" I wanted to be sure he understood, so I had him repeat the instructions back to me with the interpreter present.", "evaluation": "Strong communication technique. Combining simplified language, nonverbal cues, and the teach-back method with interpreter support helps ensure comprehension. Score: 9/10"}
{"scenario": "Scenario: Lien Hoang, 36 y/o female, complains of palpitations, weight loss, and irritability. She doesn't understand most of the questions and keeps saying 'tired.", "reference_response":"I gave her written instructions in English and scheduled follow-up in a week.", "evaluation": "While scheduling follow-up is good, relying solely on English written instructions is ineffective. A translated care summary or live interpretation is needed to ensure safety. Score: 3/10"}
{"scenario": "Scenario: Hassan Omer, 71 y/o man, speaks only Somali. He is post-operative and nods to all questions. No interpreter has been used during recovery checks.", "reference_response":"He’s nodding and smiling, so he must be doing fine.", "evaluation": "This is a risky assumption. Nodding does not confirm understanding or well-being. Patients recovering from surgery need close, clear communication. Interpreter use is essential. Score: 2/10"}
{"scenario": "Scenario: Sora Kim, 29 y/o Korean woman, comes in with a cough and fever. You use a certified interpreter, explain medications carefully, and show images of dosage times. She nods, then confirms verbally in Korean what she will do.", "reference_response":" I asked the interpreter to confirm understanding, and she explained the schedule back clearly.", "evaluation": "Excellent approach. Combining visual aids, professional interpretation, and confirmation through the patient ensures safe medication use and builds trust. Score: 9/10"}
{"scenario": "Scenario: Leila Haddad, 45 y/o Moroccan woman, arrives with a swollen ankle after falling. She speaks French and uses a translation app on her phone.", "reference_response":" I just pointed to the phone and let her use the translation app. She said she understood so I let her go.", "evaluation": "The user relied too heavily on the translation app without verifying understanding or providing visual or written instructions. There was no check for comprehension or cultural considerations. Score: 3/10"}
{"scenario": "Scenario: Nguyen Van Duc, 34 y/o Vietnamese construction worker, presents with chest tightness. He speaks limited English and is accompanied by his teenage son, who attempts to translate.", "reference_response":"I let the son translate everything since he seemed fluent. I didn't think we needed a professional interpreter.", "evaluation": "While using family members for translation is common in emergencies, it's not ideal. The user should have paused to request a certified interpreter and verified the patient's understanding directly. Score: 4/10"}
{"scenario": "Scenario: María González, 26 y/o pregnant woman, Spanish speaker, is crying during intake. She mentions cramping and hasn't eaten today.", "reference_response":" I sat her down, brought her water and crackers, and gently asked if she needed to speak to someone. I waited and listened.", "evaluation": "The response showed strong empathy and took appropriate steps by slowing down the conversation, offering food, and ensuring she felt emotionally safe before proceeding. Score: 9/10"}
{"scenario": "Scenario: Fatima Al-Rashid, 60 y/o woman wearing a headscarf, avoids eye contact and only nods when asked if she's okay. Her son explains that she speaks only Arabic.", "reference_response":"I let the son explain a few things until we could get a female interpreter. I showed pictures and kept my tone calm and polite.", "evaluation": "The user respectfully included her son briefly while waiting for a certified interpreter, ensured privacy, and confirmed understanding through visual aids. This was a sensitive and effective approach. Score: 8/10"}
{"scenario": "Scenario: Raj Patel, 52 y/o Indian man, returns after a recent diabetes diagnosis. He brings herbal supplements and asks if they can replace his medication.", "reference_response":"I thanked him for bringing the supplements and explained how they might interact with his medication. I suggested he talk to the pharmacist too.", "evaluation": "The user acknowledged the patient's cultural practices without dismissing them, explained the risks clearly, and encouraged coordination with the care team. Excellent cultural humility and patient-centered care. Score: 10/10"}
